{"keras_version": "2.0.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 256, "batch_input_shape": [null, 100, 1], "kernel_constraint": null, "dtype": "float32", "stateful": false, "activity_regularizer": null, "name": "lstm_1", "bias_regularizer": null, "unroll": false, "bias_constraint": null, "return_sequences": false, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "use_bias": true, "recurrent_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 47, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null}}]}